In [1]:
# Load library
import pandas as pd
# Create URL
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'
# Load data
dataframe = pd.read_csv(url)
# Drop duplicates, show first two rows of output
dataframe.drop_duplicates().head(2)#همه ستون ها باید شبیه به هم را حذف می کند

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [9]:
# Delete rows, show first three rows of output
dataframe[dataframe['Sex'] != 'male'].head(3)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [10]:
# Delete row, show first two rows of output
dataframe[dataframe['Name'] != 'Allison, Miss Helen Loraine'].head(2)

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [2]:
# Show number of rows
print("Number Of Rows In The Original DataFrame:", len(dataframe))
print("Number Of Rows After Deduping:", len(dataframe.drop_duplicates()))

Number Of Rows In The Original DataFrame: 1313
Number Of Rows After Deduping: 1313

In [3]:
# Drop duplicates
dataframe.drop_duplicates(subset=['Sex'])#براساس ستون جنسیت حذف می کند (فقط یک مرد و یک زن باقی می ماند)

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [4]:
# Drop duplicates
dataframe.drop_duplicates(subset=['Sex'], keep='last')# آخری را نگه می دارد

                     Name PClass   Age     Sex  Survived  SexCode
1307  Zabour, Miss Tamini    3rd   NaN  female         0        1
1312       Zimmerman, Leo    3rd  29.0    male         0        0

In [5]:
dataframe.duplicated()#سطرهایی که تکراری هست یا نیست را نشان می دهد

0       False
1       False
2       False
3       False
4       False
        ...
1308    False
1309    False
1310    False
1311    False
1312    False
Length: 1313, dtype: bool

In [6]:
# Group rows by the values of the column 'Sex', calculate mean # of each group
dataframe.groupby('Sex').mean(numeric_only=True)#بعضی از سطرها را با توجه به مقادیر مشترکشون گره می شوند

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

In [7]:
# Group rows
dataframe.groupby('Sex')

In [13]:
# Group rows, count rows
dataframe.groupby('Survived')['Name'].count()#ستون نام افرادی که زنده ماندند شمرده می شود

Survived
0    863
1    450
Name: Name, dtype: int64

In [14]:
dataframe.groupby('Survived').count()

          Name  PClass  Age  Sex  SexCode
Survived
0          863     863  443  863      863
1          450     450  313  450      450

In [11]:
# Group rows, calculate mean
dataframe.groupby(['Sex','Survived'])['Age'].mean()

Sex     Survived
female  0           24.901408
        1           30.867143
male    0           32.320780
        1           25.951875
Name: Age, dtype: float64

In [20]:
# Group rows, calculate mean
dataframe.groupby(['Sex','Survived'])['Age'].mean()

KeyError: 'Sex'

In [45]:
import pandas as pd
import numpy as np
# Create date range
time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')
# Create DataFrame
dataframe = pd.DataFrame(index=time_index)
# Create column of random values
dataframe['Sale_Amount'] = np.random.randint(1, 10, 100000)
# Group rows by week, calculate sum per week
dataframe.resample('W').sum()

            Sale_Amount
2017-06-11        86278
2017-06-18       101132
2017-06-25       101060
2017-07-02       100515
2017-07-09       100751
2017-07-16        10388

In [23]:
# Group rows by week, calculate sum per week
dataframe.resample('2W').sum()

            Sale_Amount
2017-06-11        86297
2017-06-25       201971
2017-07-09       202380
2017-07-23        10254

In [48]:
# Group rows by week, calculate sum per week
dataframe.resample('BM').sum()#end month

            Sale_Amount
2017-06-30       360208
2017-07-31       139916

In [21]:
time_index

DatetimeIndex(['2017-06-06 00:00:00', '2017-06-06 00:00:30',
               '2017-06-06 00:01:00', '2017-06-06 00:01:30',
               '2017-06-06 00:02:00', '2017-06-06 00:02:30',
               '2017-06-06 00:03:00', '2017-06-06 00:03:30',
               '2017-06-06 00:04:00', '2017-06-06 00:04:30',
               ...
               '2017-07-10 17:15:00', '2017-07-10 17:15:30',
               '2017-07-10 17:16:00', '2017-07-10 17:16:30',
               '2017-07-10 17:17:00', '2017-07-10 17:17:30',
               '2017-07-10 17:18:00', '2017-07-10 17:18:30',
               '2017-07-10 17:19:00', '2017-07-10 17:19:30'],
              dtype='datetime64[ns]', length=100000, freq='30S')

In [22]:
dataframe

                     Sale_Amount
2017-06-06 00:00:00            2
2017-06-06 00:00:30            6
2017-06-06 00:01:00            5
2017-06-06 00:01:30            6
2017-06-06 00:02:00            4
...                          ...
2017-07-10 17:17:30            8
2017-07-10 17:18:00            1
2017-07-10 17:18:30            3
2017-07-10 17:19:00            4
2017-07-10 17:19:30            9

[100000 rows x 1 columns]

In [17]:
# Show three rows
dataframe.head(3)

                     Sale_Amount
2017-06-06 00:00:00            2
2017-06-06 00:00:30            6
2017-06-06 00:01:00            5

In [25]:
# Group by month, count rows
dataframe.resample('M', label='left').count()

            Sale_Amount
2017-05-31        72000
2017-06-30        28000

In [26]:
# Group by month, count rows
dataframe.resample('M', label='right').count()

            Sale_Amount
2017-06-30        72000
2017-07-31        28000

In [ ]:
# Load library
import pandas as pd# Create URL
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'
# Load data
dataframe = pd.read_csv(url)
# Get the minimum of every column
dataframe.agg("min")